In [1]:
import pandas as pd
import datetime

In [6]:
y=[2012,2013,2014]
w=[1,2,3]
sd=[1,2,3]
ed=[6,5,4]

In [7]:
calendar=pd.DataFrame({'year':y, 'week':w, 'start_date':sd, 'end_date':ed}) #데이터프레임 만들기
calendar

   year  week  start_date  end_date
0  2012     1           1         6
1  2013     2           2         5
2  2014     3           3         4

In [8]:
calendar=calendar.sort_values(by=['end_date'], ascending=True) #오름차순 정렬하기
calendar

   year  week  start_date  end_date
2  2014     3           3         4
1  2013     2           2         5
0  2012     1           1         6

In [9]:
n=['Bucky', 'Steve', 'Tony']
nn=['Winter Soldier', 'Captain America', 'Iron man']
df_a=pd.DataFrame({'name':n, 'nickname':nn})
df_a

    name         nickname
0  Bucky   Winter Soldier
1  Steve  Captain America
2   Tony         Iron man

In [10]:
p=['Metal Arm', 'Super Soldier', 'Vibranium Suit']
df_b=pd.DataFrame({'power':p})
df_b

            power
0       Metal Arm
1   Super Soldier
2  Vibranium Suit

In [31]:
df_c=pd.concat([df_a.reset_index(drop=True), df_b], axis=1) #concat으로 행수가 같은 데이터프레임 합치기
df_c

    name         nickname           power
0  Bucky   Winter Soldier       Metal Arm
1  Steve  Captain America   Super Soldier
2   Tony         Iron man  Vibranium Suit

In [32]:
df_d=pd.DataFrame({'null':[]})
df_c=pd.concat([df_c.reset_index(drop=True), df_d], axis=1)
df_c

    name         nickname           power  null
0  Bucky   Winter Soldier       Metal Arm   NaN
1  Steve  Captain America   Super Soldier   NaN
2   Tony         Iron man  Vibranium Suit   NaN

In [33]:
df_c.isnull().sum() #결측치 알기

name        0
nickname    0
power       0
null        3
dtype: int64

In [36]:
import numpy as np

In [37]:
df=pd.DataFrame(np.nan, index=[0,1,2,3], columns=['A'])
df

    A
0 NaN
1 NaN
2 NaN
3 NaN

In [38]:
df.loc[1,'A']='A'
df

     A
0  NaN
1    A
2  NaN
3  NaN

In [41]:
products = pd.DataFrame({'category': ['Cleaning', 'Cleaning', 'Entertainment', 'Entertainment', 'Tech', 'Tech'],
        'store': ['Walmart', 'Dia', 'Walmart', 'Fnac', 'Dia','Walmart'],
        'price':[11.42, 23.50, 19.99, 15.95, 55.75, 111.55],
        'testscore': [4, 3, 5, 7, 5, 8]})
products

        category    store   price  testscore
0       Cleaning  Walmart   11.42          4
1       Cleaning      Dia   23.50          3
2  Entertainment  Walmart   19.99          5
3  Entertainment     Fnac   15.95          7
4           Tech      Dia   55.75          5
5           Tech  Walmart  111.55          8

In [42]:
pivot_products = products.pivot(index='category', columns='store', values='price')
pivot_products

store            Dia   Fnac  Walmart
category
Cleaning       23.50    NaN    11.42
Entertainment    NaN  15.95    19.99
Tech           55.75    NaN   111.55

In [44]:
people = pd.DataFrame({'FirstName' : ['John', 'Jane'],
                       'LastName' : ['Doe', 'Austen'],
                       'BloodType' : ['A-', 'B+'],
                       'Weight' : [90, 64]})
people

  FirstName LastName BloodType  Weight
0      John      Doe        A-      90
1      Jane   Austen        B+      64

In [45]:
pd.melt(people, id_vars=['FirstName', 'LastName'], var_name='measurements')

  FirstName LastName measurements value
0      John      Doe    BloodType    A-
1      Jane   Austen    BloodType    B+
2      John      Doe       Weight    90
3      Jane   Austen       Weight    64

In [46]:
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=['A', 'B', 'C'])
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [47]:
for index, row in df.iterrows() :
    print(row['A'], row['B'])

1 2
4 5
7 8

In [48]:
items=[1,2,3,4,5]
squared=list(map(lambda x:x**2, items)) #map, lambda
squared

[1, 4, 9, 16, 25]

In [49]:
numbers=range(-5,5)
less_than_zero=list(filter(lambda x:x<0, numbers)) #filter
less_than_zero

[-5, -4, -3, -2, -1]

In [50]:
squared=[x**2 for x in items] #list comprehension
squared

[1, 4, 9, 16, 25]

In [51]:
less_than_zero=[x for x in numbers if x<0]
less_than_zero

[-5, -4, -3, -2, -1]

In [54]:
np.sum([x for x in range(1,101)]) #1부터 100까지 더하기

5050

In [58]:
#*args arguments 사용법
def test_args(f_arg, *args):
    print("first arg",f_arg)
    for arg in args:
        print('another arg through *argv:', arg)
test_args('Hello', 'world!', 'I am', 'Python')

first arg Hello
another arg through *argv: world!
another arg through *argv: I am
another arg through *argv: Python

In [59]:
param=['Hello', 'world!', 'I am', 'Python']
test_args('Start', *param)

first arg Start
another arg through *argv: Hello
another arg through *argv: world!
another arg through *argv: I am
another arg through *argv: Python

In [60]:
#**kwargs Kewㅐrded arguments 사용법
def greet_me(**kwargs):
    print(kwargs.items())
    for key, value in kwargs.items():
        print("{0}={1}".format(key, value))

In [61]:
greet_me(name='Bucky', nickname='Winter Soldier')

dict_items([('name', 'Bucky'), ('nickname', 'Winter Soldier')])
name=Bucky
nickname=Winter Soldier

In [62]:
kwargs={'name':'Bucky', 'nickname': 'Winter Soldier'}
greet_me(**kwargs)

dict_items([('name', 'Bucky'), ('nickname', 'Winter Soldier')])
name=Bucky
nickname=Winter Soldier